import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-qq',
  templateUrl: 'qq.component.html',
  styleUrls: ['qq.component.css','../../../../node_modules/bootstrap/dist/css/bootstrap.min.css']
})
export class QqComponent implements OnInit {
  as_content='好久没写知乎了，看到这个问题，今天又是情人节，逼逼两句。<br>13年认识个妹纸，15年分，两年在一起，最后连家长都见了，却被告知分手。我都在想好久领证了，她却一脚踹了过来，excuse me？她属于那种我看到的第一眼，连孩子名字都想好了，快速在一起，快速分手。最后吃饭她说：对我的感激大于爱情，我做了很多对她好的事情，她就是感激。但形象不好，带不出去，小姐妹都找到了男神。身高太矮，对孩子基因不好。家里不同意：算了吧。然后就没然后了。<br>怎么说呢，对一段感情投入太多了之后，确实不敢太投入的展开下一段了，怕。我用尽了所有精力，却还被如此打击，心里阴影面积投影都可以覆盖整个地球了。<br>然后我还好，没伤心太久，但心里一直有种东西卡在那里。越来越有社交恐惧症。年龄也不小了，家里和同事都介绍了很多人给我认识，但却不能用尽全力去追求谁了，就有一搭没一搭的聊聊微信，见面我都怕，怕尴尬，我也不知道说些啥，也就这么过了。<br>倒是这两年发展了几个新的爱好，下班之后跑跑步，10km左右，跑完回来洗澡，看书，家里书柜都快满了，我喜欢看纸质的，那种翻书的手感是kindle没有的。累了打两把ps4的实况，从6岁玩ps1实况3，这也是我唯一玩的游戏了。再上一下B站之类的，一天也就这么过了。工资除了还房贷还可以存点，每年去一座雪山，去年爬了四姑娘山二峰，爱上了雪山，年初去了哈巴雪山，大风未能登顶，准备五月再去。目标慕士塔格或是卓奥友，所以每天的身体锻炼是必须的。每年出国浪一次，大马潜水，尼泊尔徒步，日本吃和牛。周末会约大学死党吃饭，会独自出去骑行100km左右。我从小主业就是足球，因为是个集体项目，我这人不太来事，叫我踢球的人也不太多，平时一周就一个小场，然后周末联赛有一次大场的机会。<br>所以我已经习惯了一个人，而且过得也不错了。你让我放弃跑步陪妹纸逛街，放弃读书陪妹纸看电视，放弃雪山陪妹纸去丽江，可能比杀了我还难受。或许也是没遇到那个对的人。<br>虽然今年27了，我爸妈每天都在数落我没女盆友，但我自己还过得不错，有独自能完成的爱好，财务独立，有房有车，每年两座雪山一个国家。我不太愿意强行安插个女朋友破坏我现在这种还算和谐的生活。<br>被伤一次之后人会变得更谨慎吧。去年有个同事介绍的还不错，约了一次吃饭，再约第二次的时候明显感觉有点困难了，然后。。。然后我就放弃了。要是原来因该会死皮赖脸的去追一下的，毕竟还有点感觉，现在，哼哼。<br>年龄越大，越会讨好自己了。不去做那些不想做的事情，精力全在自己喜欢的事情上。除了夜深人静，自己在家里略感孤独以外，其他都还好。<br>既然上天不给我结婚的机会，那我就自己好好过，要不是独生子女，爸妈天天催，我还真愿意把这种生活一直持续下去。'
  constructor() { }

  ngOnInit() {
  }

}
